app/controllers/admin_controller.rb

SELECT "reservas".* FROM "reservas"
---
  def index
    if(!session[:current_user_id])
      redirect_to("/admins")
    end

		@reservas = Reserva.all