app/controllers/funcionarios_controller.rb

SELECT "funcionarios".* FROM "funcionarios"
---
  def index
    @funcionarios = Funcionario.all

INSERT INTO "funcionarios" ("nome", "email", "funcao", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "MyString"], ["email", "MyString"], ["funcao", "MyString"], ["admin", false], ["created_at", 2016-11-07 11:35:54 UTC], ["updated_at", 2016-11-07 11:35:54 UTC]]
---
  def create
    @funcionario = Funcionario.new(funcionario_params)

    respond_to do |format|
      if @funcionario.save

DELETE FROM "funcionarios" WHERE "funcionarios"."id" = $1  [["id", 980190962]]
---
  def destroy
    @funcionario.destroy

SELECT  "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_funcionario
      @funcionario = Funcionario.find(params[:id])