app/controllers/reservas_controller.rb

  def list
    @reservas = Reserva.all
---
SELECT "reservas".* FROM "reservas"

  def create
    @reserva = Reserva.new(reserva_params)

    respond_to do |format|
      if @reserva.save
---
INSERT INTO "reservas" ("nome", "email", "telefone", "pessoas", "data", "hora", "pne", "obs", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def destroy
    @reserva.destroy
---
DELETE FROM "reservas" WHERE "reservas"."id" = $1  [["id", 1]]

    def set_reserva
      @reserva = Reserva.find(params[:id])
---
SELECT  "reservas".* FROM "reservas" WHERE "reservas"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]